import Image from "next/image";

export type AccessCategory =
  | "wheelchair"
  | "motor"
  | "temporary"
  | "intellectual"
  | "vision"
  | "hearing";

export interface Vacancy {
  id: string;
  title: string;
  salary: string;
  place: string;
  description: string;
  suitability: string;
  supports: AccessCategory[];
  applyUrl?: string;
}

export const VACANCIES: Vacancy[] = [
  {
    id: "admin_reception",
    title: "Специалист поддержки пользователей Плюса со знанием казахского языка",
    salary: "от 118 000 ₸",
    place: "Яндекс Крауд: Поддержка",
    description:
      "Проконсультируйте пользователей развлекательных сервисов на казахском и русском языках.",
    suitability:
      "💡 Особенно удобно для людей на коляске и с ограничением подвижности",
    supports: ["wheelchair", "temporary"],
    applyUrl:
      "https://almaty.hh.kz/vacancy/123374698?hhtmFrom=vacancy_search_list",
  },
  {
    id: "cashier",
    title: "Менеджер по маркетплейсам",
    salary: "280 000 ₸",
    place: "ТОО Мерусар и К",
    description:
      "Сотрудник отвечает за запуск и ведение маркетплейсов компании на платформах WB, Ozon, Kaspi и других, создание инфографики и контентных материалов, проведение переговоров с частными лицами, а также ведение и контроль всей необходимой документации..",
    suitability:
      "💡 Хороший вариант для людей с временными травмами и лёгкими ограничениями подвижности.",
    supports: ["motor", "temporary"],
    applyUrl:
      "https://almaty.hh.kz/vacancy/128032862?hhtmFrom=vacancy_search_list",
  },

  {
    id: "frontend",
    title: "Frontend Developer (React)",
    salary: "от 350 000 ₸",
    place: "Andersen",
    description:
      "Andersen ищет фронтенд-разработчика (React) для крупного проекта электронной коммерции в международной компании. Роль предполагает разработку платформы для доставки потребительских товаров в быстрорастущей бизнес-среде.), компонентами интерфейса и доступностью фронтенда.",
    suitability:
      "💡 Отлично подойдёт для людей с нарушением опорно-двигательного аппарата и слуха — работа за компьютером в комфортном режиме.",
    supports: ["wheelchair", "motor", "hearing", ],
    // тут можно позже добавить свою ссылку или форму отклика
  },

];